In [1]:
import numpy as np
import pandas as pd

In [3]:
# The code was removed by Watson Studio for sharing.

NameError: name 'client_8d13913e8caf489eb3f1b6e867cfa634' is not defined

In [ ]:
# The code was removed by Watson Studio for sharing.

In [4]:
data.describe()

NameError: name 'data' is not defined

df.info() shows data types, number of rows and columns, and memory usage of your data frame

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
group     9 non-null object
weight    9 non-null float64
dtypes: float64(1), object(1)
memory usage: 224.0+ bytes

# Sorting multiple Columns

In [5]:
data.sort_values(by=['group','weight'], ascending=[False, True], inplace=True)
print(data)

  group  weight
6     c     3.0
7     c     5.0
8     c     6.0
3     b     6.0
4     b     7.5
5     b     8.0
1     a     3.0
0     a     4.0
2     a    12.0

# Removing Duplicates

In [6]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 'k2': [3, 2, 1, 3, 3, 4, 4]})
data.sort_values(by='k2')
print(data)

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [7]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [8]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

Creating a new column based on values from another column

In [9]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami','corned beef', 'bacon', 'pastrami', 'honey ham','nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose you wanted to add a column indicating the type of animal that each food came from. Let’s write down a mapping of each distinct meat type to the kind of animal using a dictionary and a function:

In [10]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

def meat2animal(column):
    if column == 'bacon':
        return 'pig'
    elif column == 'pulled pork':
        return 'pig'
    elif column == 'pastrami':
        return 'cow'
    elif column == 'corned beef':
        return 'cow'
    elif column == 'honey ham':
        return 'pig'
    else:
        return 'salmon'

In [11]:
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could also modify the function slightly to accept a dataframe row and perform logic on more than one column

In [12]:
def use2columns(row):
    if row['animal'] == 'pig' and row['ounces'] > 4:
        return 'Big Pig'
    elif row['animal'] == 'pig' and row['ounces'] <= 4:
        return 'Little Pig'
    else:
        return 'Other Animal'

In [13]:
# Note: the apply() is used across an entire dataframe row
data['animal2'] = data.apply(use2columns, axis='columns')
data

          food  ounces  animal       animal2
0        bacon     4.0     pig    Little Pig
1  pulled pork     3.0     pig    Little Pig
2        bacon    12.0     pig       Big Pig
3     pastrami     6.0     cow  Other Animal
4  corned beef     7.5     cow  Other Animal
5        bacon     8.0     pig       Big Pig
6     pastrami     3.0     cow  Other Animal
7    honey ham     5.0     pig       Big Pig
8     nova lox     6.0  salmon  Other Animal

We can also use dataframe.assign() function to create a new column which was added in pandas version 0.16

In [14]:
df = pd.DataFrame({'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

df.assign(ratio = df['data1'] / df['data2'])

      data1     data2      ratio
0  0.782117 -0.041999 -18.622087
1 -0.416971  0.391088  -1.066182
2  0.528033 -0.361657  -1.460040
3 -0.976249  1.132072  -0.862356
4  0.655830 -0.559267  -1.172659

Removing or dropping a column

In [15]:
data.drop(columns=['animal'], inplace=True)
data

          food  ounces       animal2
0        bacon     4.0    Little Pig
1  pulled pork     3.0    Little Pig
2        bacon    12.0       Big Pig
3     pastrami     6.0  Other Animal
4  corned beef     7.5  Other Animal
5        bacon     8.0       Big Pig
6     pastrami     3.0  Other Animal
7    honey ham     5.0       Big Pig
8     nova lox     6.0  Other Animal

Replacing Values in a Series

In [16]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [17]:
#If you want to replace -999 with NaN:
data.replace(-999, np.nan, inplace=True)
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [18]:
#If you want to replace multiple values at once, you instead pass a list then the substitute value:

data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [19]:
data.replace([-999, -1000], np.nan, inplace=True)
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Obtaining columns with partial column labels

In [20]:

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.964030  0.132973
1    a  two -0.359956 -0.289193
2    b  one -0.878394 -1.747646
3    b  two -1.489734  0.267113
4    a  one -1.488526 -0.199493

In [22]:
df.filter(like='key')

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

Getting Value Counts

In [23]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [24]:
data['group'].value_counts()

b    3
a    3
c    3
Name: group, dtype: int64

Getting Cumulative Sum

In [25]:
data['group'].value_counts().cumsum()

b    3
a    6
c    9
Name: group, dtype: int64

# Pivot table

In [26]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

Calculating the means of each group

In [27]:
data.pivot_table(values='ounces',index='group',aggfunc=np.mean)

         ounces
group
a      6.333333
b      7.166667
c      4.666667

Getting counts by group

In [28]:
data.pivot_table(values='ounces',index='group',aggfunc='count')

       ounces
group
a           3
b           3
c           3

Getting cumulative sum or running total of the group counts

In [29]:
data.pivot_table(values='ounces',index='group',aggfunc='count').cumsum()

       ounces
group
a           3
b           6
c           9

You can pass a dictionary to the aggfunc= parameter to specify specific columns to have specific aggregate function applied to them

In [30]:
data.pivot_table(values='ounces', index='group', aggfunc={'group': len, 'ounces': np.sum})

       group  ounces
group
a          3    19.0
b          3    21.5
c          3    14.0

# Percent of rows

In [31]:
data = pd.DataFrame({'group': [80, 70, 75, 75],
                     'ounces': [20, 30, 25, 25],
                     'size': [100, 100, 100, 100]}
                   )
data

   group  ounces  size
0     80      20   100
1     70      30   100
2     75      25   100
3     75      25   100

In [32]:
perc_of_rows = data.apply(lambda x : x / x.sum() * 100, axis='columns') # or axis=1
perc_of_rows

   group  ounces  size
0   40.0    10.0  50.0
1   35.0    15.0  50.0
2   37.5    12.5  50.0
3   37.5    12.5  50.0

# Percent of columns

In [33]:
perc_of_columns = data.apply(lambda x : x / x.sum() * 100, axis='index') # or axis=0
perc_of_columns

       group  ounces  size
0  26.666667    20.0  25.0
1  23.333333    30.0  25.0
2  25.000000    25.0  25.0
3  25.000000    25.0  25.0

In [34]:
#percent of a specific column:
data['Perc_of_Group_Column'] = data['group'] / data['group'].sum() * 100
data

   group  ounces  size  Perc_of_Group_Column
0     80      20   100             26.666667
1     70      30   100             23.333333
2     75      25   100             25.000000
3     75      25   100             25.000000

# Transpose a dataframe

Let's say you have a data frame with several columns and don't want to horizontally scroll to see the columns, but want to vertically scroll instead. Then that case, transpose the data frame.

In [35]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.020493  0.405348
1    a  two  1.546577  2.593825
2    b  one -0.404039 -0.434149
3    b  two  0.795581 -0.961672
4    a  one -1.736118  1.702216

In [36]:
df.head(1).transpose()

              0
key1          a
key2        one
data1   1.02049
data2  0.405348

To convert a dataframe index to a column, we use reset_index()

To set the dataframe's index to be one of the columns, use set_index('index_name')

# Using category data type to control sort order

In [37]:
data = pd.DataFrame({'medal': ['bronze', 'silver', 'silver', 'gold','bronze', 'bronze', 'gold', 'gold','gold'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

    medal  ounces
0  bronze     4.0
1  silver     3.0
2  silver    12.0
3    gold     6.0
4  bronze     7.5
5  bronze     8.0
6    gold     3.0
7    gold     5.0
8    gold     6.0

In [38]:
data["medal"] = data["medal"].astype("category")
data.dtypes

medal     category
ounces     float64
dtype: object

In [39]:
data.sort_values(by=["medal"])

    medal  ounces
0  bronze     4.0
4  bronze     7.5
5  bronze     8.0
3    gold     6.0
6    gold     3.0
7    gold     5.0
8    gold     6.0
1  silver     3.0
2  silver    12.0

Now define the order of the catgorical data using set_categories()

In [40]:
data["medal"].cat.set_categories([ "gold","silver","bronze"], inplace=True)

In [41]:
data.sort_values(by='medal')

    medal  ounces
3    gold     6.0
6    gold     3.0
7    gold     5.0
8    gold     6.0
1  silver     3.0
2  silver    12.0
0  bronze     4.0
4  bronze     7.5
5  bronze     8.0

In [42]:
a = [['a', '1.2', '4.2'], ['b', '70', '0.03'], ['x', '5', '0']]
df = pd.DataFrame(a, columns=['one', 'two', 'three'])
df

  one  two three
0   a  1.2   4.2
1   b   70  0.03
2   x    5     0

# Converting a data type of a column in a data frame

In [43]:
#checking the data types of the variables:
df.dtypes

one      object
two      object
three    object
dtype: object

In [44]:
#converting data types of 'two' and 'three' columns to float:
df[['two', 'three']] = df[['two', 'three']].astype(float)

In [45]:
df.dtypes

one       object
two      float64
three    float64
dtype: object